var map = require("../../iRobots/baidu.js");



// var data = ["苏州常熟市虞山街道方塔鸭潭头",
//     "苏州常熟市碧溪新区吴市办事处三湾村",
//     "苏州太仓市城厢镇北门一村",
//     "苏州昆山市开发区阳光水世界",
//     "苏州昆山市玉山镇北门路永盛广场",
//     "苏州昆山市开发区首创悦都小区",
//     "苏州昆山市玉山镇世茂蝶湖湾小区",
//     "苏州昆山市玉山镇澞和苑",
//     "苏州昆山市周市镇时代名苑",
//     "苏州昆山市玉山镇珑庭家园",
//     "苏州昆山市开发区珠江御景",
//     "苏州吴中区香山街道花样年·别样城",
//     "苏州吴中区木渎镇五峰村",
//     "苏州吴中区木渎镇青年城",
//     "苏州吴中区甪直镇维拉花园",
//     "苏州相城区元和街道誉相庭",
//     "苏州相城区黄埭镇潘阳新村",
//     "苏州相城区元和街道朱巷社区",
//     "苏州姑苏区虎丘街道西叶家弄",
//     "苏州姑苏区金阊街道三元三村",
//     "苏州姑苏区金阊街道利景华庭",
//     "苏州姑苏区苏锦街道万科金域平江",
//     "苏州工业园区九龙仓时代上城",
//     "苏州工业园区唯亭街道青剑湖花园",
//     "苏州工业园区海尚壹品",
//     "苏州工业园区娄葑街道徐家浜北二村",
//     "苏州工业园区雅戈尔潇邦东区",
//     "苏州工业园区东湖大郡2期",
//     "苏州工业园区海德公园",
//     "苏州工业园区水墨花园",
//     "苏州工业园区娄葑街道东港新村二组团",
//     "苏州工业园区荣域花园",
//     "苏州工业园区唯亭街道张泾一村",
//     "苏州工业园区嘉瑞巷乐嘉大厦",
//     "苏州工业园区太阳星辰花园",
//     "苏州工业园区星公元名邸",
//     "苏州工业园区娄葑街道东港二村",
//     "苏州高新区（虎丘区）通安镇华通花园",
//     "苏州高新区（虎丘区）浒墅关经济开发区鸿文雅苑",
//     "苏州吴江区盛泽镇城中花园",
//     "苏州吴江区震泽镇太平街道",
//     "苏州吴江区盛泽镇碧桂园小区",
//     "苏州吴江区松陵街道鲈乡三村",
//     "苏州吴江区平望镇印象家园",
//     "苏州昆山市玉山镇珑庭花园",
//     "苏州工业园区唯亭街道青剑湖花园",
//     "苏州工业园区东港二村",
//     "苏州工业园区东港二村",
//     "苏州昆山市玉山镇麒麟新村"]



//var data = ["苏州工业园区莲花新村5区","苏州工业园区星公元名邸","苏州昆山市开发区中航城花园","苏州常熟市鸭潭头小区","苏州昆山市开发区中航城花园","苏州昆山市玉山镇民营路工厂宿舍","苏州吴中区南香花弄","苏州工业园区星公元名邸"]
//var data = ["苏州高新区（虎丘区）浒墅关经济开发区鸿文雅苑","苏州吴中区木渎镇方圆·云山诗意","苏州吴中区郭巷街道国泰三村"]
//var str = "苏州常熟市鸭潭头小区,苏州常熟市碧溪街道吴市三湾村,苏州常熟市虞山街道五星新村2区,苏州太仓市城厢镇北门一村,苏州太仓市锦州路福乐园,苏州昆山市阳光水世界花苑,苏州昆山市玉山镇北门路永盛广场,苏州昆山市开发区首创悦都,苏州昆山市玉山镇世茂·蝶湖湾,苏州昆山市玉山镇澞和苑,苏州昆山市周市镇时代名苑,苏州昆山市玉山镇珑庭花园,苏州昆山市开发区珠江御景花园,苏州昆山市开发区中航城花园,苏州昆山市玉山镇民营路工厂宿舍,苏州昆山市玉山镇麒麟新村,苏州吴江区盛泽镇城中花园,苏州吴江区震泽镇太平街,苏州吴江区盛泽镇碧桂园时代城,苏州吴江区松陵街道鲈乡三村,苏州吴江区平望镇印象家园,苏州吴中区香山街道花样年·别样城,苏州吴中区木渎镇五峰村,苏州吴中区木渎镇青年城,苏州吴中区甪直镇维拉花园 ,苏州吴中区南香花弄,苏州吴中区木渎镇方圆·云山诗意,苏州吴中区郭巷街道国泰三村,苏州相城区元和街道誉相庭,苏州相城区黄埭镇潘阳新村,苏州相城区元和街道朱巷社区,苏州姑苏区虎丘街道西叶家弄,苏州姑苏区金阊街道三元三村,苏州姑苏区金阊街道利景华庭,苏州姑苏区苏锦街道万科·金域平江,苏州工业园区九龙仓时代上城,苏州工业园区唯亭街道青剑湖花园,苏州工业园区海尚壹品,苏州工业园区娄葑街道徐家浜二村,苏州工业园区雅戈尔潇邦东区,苏州工业园区东湖大郡二期,苏州工业园区海德公园,苏州工业园区水墨花园,苏州工业园区娄葑街道东港新村二组团,苏州工业园区荣域花园,苏州工业园区唯亭街道张泾一村,苏州工业园区嘉瑞巷乐嘉大厦,苏州工业园区太阳星辰花园,苏州工业园区星公元名邸,苏州工业园区娄葑街道东港二村,苏州工业园区莲花新村五区,苏州高新区（虎丘区）通安镇华通花园一区,苏州高新区（虎丘区）浒墅关经济开发区鸿文雅苑,苏州高新区狮山路汇豪国际";
//var str= "苏州张家港市杨舍镇东莱徐丰社区,苏州昆山市玉山镇开心公寓,吴江区松陵街道友谊村"
//var str = "苏州姑苏区仁安街,苏州相城区元和街道金御华府,苏州昆山市千灯镇华强阳光都城花园,苏州相城区元和街道富豪商业一街"
//var str = '苏州吴江区八坼街道友谊村';
//var str = "苏州高新区枫桥街道金科王府一期"；
var str = "苏州昆山市张浦裕花园";
var data = str.split(",");
getResult().then((data) => {
    console.log(JSON.stringify(data));
})
async function getResult() {
    var results = [];
    for (let i of data) {
        var t = await addrToGeoFull(i);
        console.log(t.name,t.sname)
        results.push(t);
    }
    return results;
}



function addrToGeoFull(name, scity = "苏州") {
    let position = null, city = null, district = null, sname = null;
    return map.loadPlaceAPI(name, scity).then(function (data) {
        if (data.status == 0 && data.total >= 0 && data.results.length > 0) {
            //console.log(data.results);
            var rs = data.results[0];
            position = (rs.location) ? rs.location : null;
            city = (rs.city) ? rs.city : null;
            district = (rs.area) ? rs.area : null;
            sname = (rs.name) ? rs.name : null;
        }
        //console.log({position,city,district})
        return { position, city, district, name, sname };
    }).catch(function (e) {
        console.log(e);
        return { position, city, district, name, sname };
    })
}

// var ADDR = [{"position":{"lat":31.656148,"lng":120.754869},"city":"苏州市","district":"常熟市","name":"苏州常熟市虞山街道方塔鸭潭头","sname":"方塔鸭潭头"},{"position":{"lat":31.720276,"lng":120.992772},"city":"苏州市","district":"常熟市","name":"苏州常熟市碧溪新区吴市办事处三湾村","sname":"吴市办事处三湾村"},{"position":{"lat":31.453558,"lng":121.108264},"city":"苏州市","district":"太仓市","name":"苏州太仓市城厢镇北门一村","sname":"北门一村"},{"position":{"lat":31.382481,"lng":121.049529},"city":"苏州市","district":"昆山市","name":"苏州昆山市开发区阳光水世界","sname":"阳光水世界"},{"position":{"lat":31.421599,"lng":120.955762},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇北门路永盛广场","sname":"永盛广场"},{"position":{"lat":31.372541,"lng":121.072846},"city":"苏州市","district":"昆山市","name":"苏州昆山市开发区首创悦都小区","sname":"首创悦都"},{"position":{"lat":31.345664,"lng":120.968778},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇世茂蝶湖湾小区","sname":"蝶湖湾小区"},{"position":{"lat":31.378085,"lng":120.954626},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇澞和苑","sname":"澞和苑"},{"position":{"lat":31.410438,"lng":121.00161},"city":"苏州市","district":"昆山市","name":"苏州昆山市周市镇时代名苑","sname":"时代名苑"},{"position":{"lat":31.364867,"lng":120.955286},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇珑庭家园","sname":"珑庭花园"},{"position":{"lat":31.395568,"lng":121.038919},"city":"苏州市","district":"昆山市","name":"苏州昆山市开发区珠江御景","sname":"珠江御景"},{"position":{"lat":31.229746,"lng":120.427162},"city":"苏州市","district":"吴中区","name":"苏州吴中区香山街道花样年·别样城","sname":"花样年别样城"},{"position":{"lat":31.276585,"lng":120.479273},"city":"苏州市","district":"吴中区","name":"苏州吴中区木渎镇五峰村","sname":"五峰村"},{"position":{"lat":31.288041,"lng":120.529314},"city":"苏州市","district":"吴中区","name":"苏州吴中区木渎镇青年城","sname":"尼盛青年城"},{"position":{"lat":31.284688,"lng":120.846055},"city":"苏州市","district":"吴中区","name":"苏州吴中区甪直镇维拉花园","sname":"南山维拉花园"},{"position":{"lat":31.364432,"lng":120.648635},"city":"苏州市","district":"相城区","name":"苏州相城区元和街道誉相庭","sname":"誉相庭"},{"position":{"lat":31.446914,"lng":120.552175},"city":"苏州市","district":"相城区","name":"苏州相城区黄埭镇潘阳新村","sname":"潘阳新村"},{"position":{"lat":31.414674,"lng":120.623651},"city":"苏州市","district":"相城区","name":"苏州相城区元和街道朱巷社区","sname":"朱巷社区"},{"position":{"lat":31.32222,"lng":120.607983},"city":"苏州市","district":"姑苏区","name":"苏州姑苏区虎丘街道西叶家弄","sname":"西叶家弄"},{"position":{"lat":31.31132,"lng":120.580813},"city":"苏州市","district":"姑苏区","name":"苏州姑苏区金阊街道三元三村","sname":"三元三村"},{"position":{"lat":31.311705,"lng":120.608583},"city":"苏州市","district":"姑苏区","name":"苏州姑苏区金阊街道利景华庭","sname":"利景华庭"},{"position":{"lat":31.350417,"lng":120.622793},"city":"苏州市","district":"姑苏区","name":"苏州姑苏区苏锦街道万科金域平江","sname":"万科金域平江"},{"position":{"lat":31.339876,"lng":120.756463},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区九龙仓时代上城","sname":"九龙仓时代上城花园"},{"position":{"lat":31.365367,"lng":120.721704},"city":"苏州市","district":"吴中区","name":"苏州工业园区唯亭街道青剑湖花园","sname":"青剑湖花园"},{"position":{"lat":31.335631,"lng":120.722911},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区海尚壹品","sname":"海尚壹品"},{"position":{"lat":31.316466,"lng":120.659847},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区娄葑街道徐家浜北二村","sname":"徐家浜北二村"},{"position":{"lat":31.337052,"lng":120.712764},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区雅戈尔潇邦东区","sname":"雅戈尔潇邦"},{"position":{"lat":31.317163,"lng":120.738243},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区东湖大郡2期","sname":"东湖大郡2期"},{"position":{"lat":31.279153,"lng":120.755193},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区海德公园","sname":"建屋·海德公园"},{"position":{"lat":31.325941,"lng":120.760717},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区水墨花园","sname":"水墨花园"},{"position":{"lat":31.327521,"lng":120.6568},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区娄葑街道东港新村二组团","sname":"东港新村-二组团"},{"position":{"lat":31.290093,"lng":120.729603},"city":"苏州市","district":"吴中区","name":"苏州工业园区荣域花园","sname":"荣域花园"},{"position":{"lat":31.346866,"lng":120.702269},"city":"苏州市","district":"吴中区","name":"苏州工业园区唯亭街道张泾一村","sname":"张泾新村一区"},{"position":{"lat":31.330961,"lng":120.725689},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区嘉瑞巷乐嘉大厦","sname":"乐嘉大厦"},{"position":{"lat":31.337467,"lng":120.772292},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区太阳星辰花园","sname":"太阳星辰花园"},{"position":{"lat":31.316278,"lng":120.760428},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区星公元名邸","sname":"星公元名邸"},{"position":{"lat":31.32228,"lng":120.658721},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区娄葑街道东港二村","sname":"东港二村"},{"position":{"lat":31.384418,"lng":120.489091},"city":"苏州市","district":"虎丘区","name":"苏州高新区（虎丘区）通安镇华通花园","sname":"华通花园"},{"position":{"lat":31.365294,"lng":120.523719},"city":"苏州市","district":"虎丘区","name":"苏州高新区（虎丘区）浒墅关经济开发区鸿文雅苑","sname":"鸿文雅苑"},{"position":{"lat":30.910275,"lng":120.654631},"city":"苏州市","district":"吴江区","name":"苏州吴江区盛泽镇城中花园","sname":"盛泽城中花园"},{"position":{"lat":30.91566,"lng":120.506896},"city":"苏州市","district":"吴江区","name":"苏州吴江区震泽镇太平街道","sname":"吴江市震泽镇街道办"},{"position":{"lat":30.907052,"lng":120.622675},"city":"苏州市","district":"吴江区","name":"苏州吴江区盛泽镇碧桂园小区","sname":"碧桂园"},{"position":{"lat":31.174034,"lng":120.642978},"city":"苏州市","district":"吴江区","name":"苏州吴江区松陵街道鲈乡三村","sname":"松陵街道鲈乡三村"},{"position":{"lat":30.988752,"lng":120.640449},"city":"苏州市","district":"吴江区","name":"苏州吴江区平望镇印象家园","sname":"印象嘉园"},{"position":{"lat":31.364867,"lng":120.955286},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇珑庭花园","sname":"珑庭花园"},{"position":{"lat":31.365367,"lng":120.721704},"city":"苏州市","district":"吴中区","name":"苏州工业园区唯亭街道青剑湖花园","sname":"青剑湖花园"},{"position":{"lat":31.32228,"lng":120.658721},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区东港二村","sname":"东港二村"},{"position":{"lat":31.32228,"lng":120.658721},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区东港二村","sname":"东港二村"},{"position":{"lat":31.390488,"lng":120.963103},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇麒麟新村","sname":"麒麟新村"},{"position":{"lat":31.289306,"lng":120.73711},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区莲花新村5区","sname":"莲花新村五区"},{"position":{"lat":31.316278,"lng":120.760428},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区星公元名邸","sname":"星公元名邸"},{"position":{"lat":31.387509,"lng":121.033844},"city":"苏州市","district":"昆山市","name":"苏州昆山市开发区中航城花园","sname":"中航城"},{"position":{"lat":31.657317,"lng":120.754968},"city":"苏州市","district":"常熟市","name":"苏州常熟市鸭潭头小区","sname":"鸭潭头小区"},{"position":{"lat":31.387509,"lng":121.033844},"city":"苏州市","district":"昆山市","name":"苏州昆山市开发区中航城花园","sname":"中航城"},{"position":{"lat":31.412178,"lng":120.947738},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇民营路工厂宿舍","sname":"民营路"},{"position":{"lat":31.169874,"lng":120.54318},"city":"苏州市","district":"吴中区","name":"苏州吴中区南香花弄","sname":"南香花弄"},{"position":{"lat":31.316278,"lng":120.760428},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区星公元名邸","sname":"星公元名邸"},{"position":{"lat":31.365294,"lng":120.523719},"city":"苏州市","district":"虎丘区","name":"苏州高新区（虎丘区）浒墅关经济开发区鸿文雅苑","sname":"鸿文雅苑"},{"position":{"lat":31.260619,"lng":120.544387},"city":"苏州市","district":"吴中区","name":"苏州吴中区木渎镇方圆·云山诗意","sname":"方圆·云山诗意"},{"position":{"lat":31.25759,"lng":120.691642},"city":"苏州市","district":"吴中区","name":"苏州吴中区郭巷街道国泰三村","sname":"国泰三村"}]// var ADDR = [{"position":{"lat":31.289306,"lng":120.73711},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区莲花新村5区","sname":"莲花新村五区"},{"position":{"lat":31.316278,"lng":120.760428},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区星公元名邸","sname":"星公元名邸"},{"position":{"lat":31.387509,"lng":121.033844},"city":"苏州市","district":"昆山市","name":"苏州昆山市开发区中航城花园","sname":"中航城"},{"position":{"lat":31.657317,"lng":120.754968},"city":"苏州市","district":"常熟市","name":"苏州常熟市鸭潭头小区","sname":"鸭潭头小区"},{"position":{"lat":31.387509,"lng":121.033844},"city":"苏州市","district":"昆山市","name":"苏州昆山市开发区中航城花园","sname":"中航城"},{"position":{"lat":31.412178,"lng":120.947738},"city":"苏州市","district":"昆山市","name":"苏州昆山市玉山镇民营路工厂宿舍","sname":"民营路"},{"position":{"lat":31.169874,"lng":120.54318},"city":"苏州市","district":"吴中区","name":"苏州吴中区南香花弄","sname":"南香花弄"},{"position":{"lat":31.316278,"lng":120.760428},"city":"苏州市","district":"苏州工业园区","name":"苏州工业园区星公元名邸","sname":"星公元名邸"}];
// var T = {};
// ADDR.sort((i,j)=>{
//     return i.name.localeCompare(j.name);
// })
// ADDR.forEach((i,j)=>{
//     i.count = 1;
//     if(T[i.sname]){
//         i.count++;
//         T[i.sname]=i;
//     }else{
//         T[i.sname]=i;
//     }
   
//     console.log(i.name,i.sname,i.count,j)
// })

// for(let x in T){
//     console.log(x,T[x].count);
// }

